Tekla.Structures.Dialog.StructuresDialogAttribute
The StructuresDialogAttribute class specifies the attribute name to which the value of the
property will be bound in Tekla Structures.

Tekla.Structures.Dialog.StructuresDialogAttribute.#ctor(System.String)
Initializes a new StructuresDialogAttribute instance.
attributeName: The attribute name of the property.

Tekla.Structures.Dialog.StructuresDialogAttribute.#ctor(System.String,System.Type)
Initializes a new StructuresDialogAttribute instance.
attributeName: The attribute name of the property.
attributeType: The attribute type of the property.

Tekla.Structures.Dialog.StructuresDialogAttribute.#ctor(System.String,System.String)
Initializes a new StructuresDialogAttribute instance.
attributeName: The attribute name of the property.
attributeType: The attribute type of the property, default is String.

Tekla.Structures.Dialog.StructuresDialogAttribute.GetCorrectDialogAttributeType(System.String)
Initializes a new StructuresDialogAttribute instance.
attributeType: The attribute type of the property, default is String.

Tekla.Structures.Dialog.StructuresDialogAttribute.AttributeName
Gets the attribute name of the property.

Tekla.Structures.Dialog.StructuresDialogAttribute.AttributeType
Gets the attribute type of the property.

Tekla.Structures.Dialog.StructuresDialogAttribute.ToString
Returns a string that represents the current StructuresDialogAttribute object.
Returns: A string that represents the current StructuresDialogAttribute object.